<?php
$modal_success_title = get_field('modl_success_title','option') ? get_field('modl_success_title','option') : 'Заявка отправлена';
$modal_success_desc = get_field('modal_success_desc','option') ? get_field('modal_success_desc','option') : 'Менеджер свяжется с вами в ближайшее время';

?>
<div id="modal-success" class="modal-window modal-success">
    <div class="close-modal-btn">
        <svg width="23" height="23" viewBox="0 0 23 23" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M17.3243 6.01062C17.5195 5.81536 17.5196 5.49877 17.3243 5.30351C17.129 5.10826 16.8125 5.10826 16.6172 5.30352L16.9707 5.65707L17.3243 6.01062ZM5.30376 16.617C5.10849 16.8122 5.10849 17.1288 5.30375 17.3241C5.49901 17.5193 5.81559 17.5193 6.01085 17.3241L5.6573 16.9705L5.30376 16.617ZM16.9707 5.65707L16.6172 5.30352L5.30376 16.617L5.6573 16.9705L6.01085 17.3241L17.3243 6.01062L16.9707 5.65707Z" fill="#171717" />
            <path d="M5.30312 6.01094C5.10786 5.81568 5.10787 5.4991 5.30313 5.30383C5.4984 5.10857 5.81498 5.10856 6.01024 5.30382L5.65668 5.65738L5.30312 6.01094ZM17.3234 16.6169C17.5186 16.8122 17.5186 17.1288 17.3234 17.3241C17.1281 17.5193 16.8115 17.5193 16.6162 17.3241L16.9698 16.9705L17.3234 16.6169ZM5.65668 5.65738L6.01024 5.30382L17.3234 16.6169L16.9698 16.9705L16.6162 17.3241L5.30312 6.01094L5.65668 5.65738Z" fill="#171717" />
        </svg>
    </div>
    <div class="modal-window__content">
        <div class="modal-window__title">Заявка отправлена</div>
        <div class="modal-window__desc">Менеджер свяжется с вами в ближайшее время</div>
    </div>
</div>

<div id="modal-callback" class="modal-window modal-callback">
    <div class="close-modal-btn">
        <svg width="23" height="23" viewBox="0 0 23 23" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M17.3243 6.01062C17.5195 5.81536 17.5196 5.49877 17.3243 5.30351C17.129 5.10826 16.8125 5.10826 16.6172 5.30352L16.9707 5.65707L17.3243 6.01062ZM5.30376 16.617C5.10849 16.8122 5.10849 17.1288 5.30375 17.3241C5.49901 17.5193 5.81559 17.5193 6.01085 17.3241L5.6573 16.9705L5.30376 16.617ZM16.9707 5.65707L16.6172 5.30352L5.30376 16.617L5.6573 16.9705L6.01085 17.3241L17.3243 6.01062L16.9707 5.65707Z" fill="#171717" />
            <path d="M5.30312 6.01045C5.10786 5.81519 5.10787 5.49861 5.30313 5.30334C5.4984 5.10808 5.81498 5.10807 6.01024 5.30333L5.65668 5.65689L5.30312 6.01045ZM17.3234 16.6165C17.5186 16.8117 17.5186 17.1283 17.3234 17.3236C17.1281 17.5188 16.8115 17.5188 16.6162 17.3236L16.9698 16.97L17.3234 16.6165ZM5.65668 5.65689L6.01024 5.30333L17.3234 16.6165L16.9698 16.97L16.6162 17.3236L5.30312 6.01045L5.65668 5.65689Z" fill="#171717" />
        </svg>
    </div>
    <div class="modal-window__content">
        <div class="modal-window__title">Оставить заявку</div>
        <div class="modal-window__subtitle">Оставьте номер — специалист свяжется с вами в рабочее время</div>
        <?=do_shortcode('[contact-form-7 id="8850132" title="Модальная форма"]')?>
    </div>
</div>
<?php